&НаСервере
Функция ДанныеСотрудника(Сотрудник)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОСотрудникахСрезПоследних.Подразделение КАК Подразделение,
		|	СведенияОСотрудникахСрезПоследних.Оклад КАК Оклад
		|ИЗ
		|	РегистрСведений.СведенияОСотрудниках.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК СведенияОСотрудникахСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Структура=Новый Структура("Подразделение,Оклад",ВыборкаДетальныеЗаписи.Подразделение,ВыборкаДетальныеЗаписи.Оклад);
		Возврат Структура;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКонстанту()
	Возврат Константы.Премия.Получить();
КонецФункции

&НаКлиенте
Процедура ОсновныеНачисленияСотрудникПриИзменении(Элемент)
	Структура=ДанныеСотрудника(Элементы.ОсновныеНачисления.ТекущиеДанные.Сотрудник);
	Если Структура=Неопределено Тогда Возврат КонецЕсли;
	Элементы.ОсновныеНачисления.ТекущиеДанные.Подразделение=Структура.Подразделение;
	Элементы.ОсновныеНачисления.ТекущиеДанные.Размер=Структура.Оклад;
	Элементы.ОсновныеНачисления.ТекущиеДанные.График=Структура.Подразделение.График;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНачисленияСотрудникПриИзменении(Элемент)
	//Структура=ДанныеСотрудника(Элементы.ДополнительныеНачисления.ТекущиеДанные.Сотрудник);
	//Если Структура=Неопределено Тогда Возврат КонецЕсли;
	//Элементы.ДополнительныеНачисления.ТекущиеДанные.Подразделение=Структура.Подразделение;
	//Элементы.ДополнительныеНачисления.ТекущиеДанные.Размер=ПолучитьКонстанту();
КонецПроцедуры  

&НаКлиенте
Процедура УдержанияСотрудникПриИзменении(Элемент) 
	Структура=ДанныеСотрудника(Элементы.Удержания.ТекущиеДанные.Сотрудник);
	Если Структура=Неопределено Тогда Возврат КонецЕсли;
	Элементы.Удержания.ТекущиеДанные.Подразделение=Структура.Подразделение;
	Элементы.Удержания.ТекущиеДанные.Размер=1;
КонецПроцедуры

