
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл 
		Если ТекСтрокаОсновныеНачисления.ВидРасчета.СпособРасчета=Перечисления.СпособыРасчета.Оклад Тогда
			Движение = Движения.ОсновныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
			Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
			Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачисления.ДатаОкончания;
			Движение.ПериодРегистрации = НачалоМесяца(Дата);
			Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
			Движение.Подразделение = ТекСтрокаОсновныеНачисления.Подразделение;
			Движение.БазовыйПериодНачало=ТекСтрокаОсновныеНачисления.ДатаНачала;
			Движение.БазовыйПериодКонец=КонецМесяца(ТекСтрокаОсновныеНачисления.ДатаНачала);
			//Движение.БазовыйПериодНачало=ДобавитьМесяц(НачалоМесяца(ТекСтрокаОсновныеНачисления.ДатаНачала),-3);
			//Движение.БазовыйПериодКонец=НачалоМесяца(ТекСтрокаОсновныеНачисления.ДатаНачала)-1;
			Движение.Результат = 0;//Результат;
			Движение.Размер = ТекСтрокаОсновныеНачисления.Размер;
			Движение.График = ТекСтрокаОсновныеНачисления.График;
		КонецЕсли;
	КонецЦикла;
 	Движения.ОсновныеНачисления.Записать();
	
	Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл 
		Если ТекСтрокаОсновныеНачисления.ВидРасчета.СпособРасчета=Перечисления.СпособыРасчета.Отпуск Тогда
			Если ТекСтрокаОсновныеНачисления.ДатаОкончания>КонецМесяца(ТекСтрокаОсновныеНачисления.ДатаНачала) Тогда
				Движение = Движения.ОсновныеНачисления.Добавить();
				Движение.Сторно = Ложь;
				Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
				Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
				Движение.ПериодДействияКонец = КонецМесяца(ТекСтрокаОсновныеНачисления.ДатаНачала);
				Движение.ПериодРегистрации = НачалоМесяца(Дата);
				Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
				Движение.Подразделение = ТекСтрокаОсновныеНачисления.Подразделение;
				Движение.БазовыйПериодНачало=ДобавитьМесяц(НачалоМесяца(ТекСтрокаОсновныеНачисления.ДатаНачала),-3);
				Движение.БазовыйПериодКонец=НачалоМесяца(ТекСтрокаОсновныеНачисления.ДатаНачала)-1;
				Движение.Результат = 0;//Результат;
				Движение.Размер = ТекСтрокаОсновныеНачисления.Размер;
				Движение.График = ТекСтрокаОсновныеНачисления.График;

				Движение = Движения.ОсновныеНачисления.Добавить();
				Движение.Сторно = Ложь;
				Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
				Движение.ПериодДействияНачало = КонецМесяца(ТекСтрокаОсновныеНачисления.ДатаНачала) +1;
				Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачисления.ДатаОкончания;
				Движение.ПериодРегистрации =  НачалоМесяца(Дата);
				Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
				Движение.Подразделение = ТекСтрокаОсновныеНачисления.Подразделение;
				Движение.БазовыйПериодНачало=ДобавитьМесяц(НачалоМесяца(ТекСтрокаОсновныеНачисления.ДатаНачала),-2);
				Движение.БазовыйПериодКонец=КонецМесяца(ТекСтрокаОсновныеНачисления.ДатаНачала);
				Движение.Результат = 0;//Результат;
				Движение.Размер = ТекСтрокаОсновныеНачисления.Размер;
				Движение.График = ТекСтрокаОсновныеНачисления.График;
			Иначе	
				Движение = Движения.ОсновныеНачисления.Добавить();
				Движение.Сторно = Ложь;
				Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
				Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
				Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачисления.ДатаОкончания;
				Движение.ПериодРегистрации = НачалоМесяца(Дата);
				Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
				Движение.Подразделение = ТекСтрокаОсновныеНачисления.Подразделение;
				Движение.БазовыйПериодНачало=ДобавитьМесяц(НачалоМесяца(ТекСтрокаОсновныеНачисления.ДатаНачала),-3);
				Движение.БазовыйПериодКонец=НачалоМесяца(ТекСтрокаОсновныеНачисления.ДатаНачала)-1;
				Движение.Результат = 0;//Результат;
				Движение.Размер = ТекСтрокаОсновныеНачисления.Размер;
				Движение.График = ТекСтрокаОсновныеНачисления.График;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
 	Движения.ОсновныеНачисления.Записать();
	
	// регистр ДополнительныеНачисления
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаДополнительныеНачисления Из ДополнительныеНачисления Цикл
		Движение = Движения.ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаДополнительныеНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаДополнительныеНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = КонецМесяца(ТекСтрокаДополнительныеНачисления.ДатаОкончания);
		Движение.ПериодРегистрации = НачалоМесяца(Дата);
		Движение.Сотрудник = ТекСтрокаДополнительныеНачисления.Сотрудник;
		Движение.Подразделение = ТекСтрокаОсновныеНачисления.Подразделение;
		//Движение.БазовыйПериодНачало=НачалоМесяца(ТекСтрокаОсновныеНачисления.ДатаНачала);
		//Движение.БазовыйПериодКонец=КонецМесяца(ТекСтрокаОсновныеНачисления.ДатаОкончания);
		Движение.Результат = 0;//Результат;
		Движение.Размер = ТекСтрокаДополнительныеНачисления.Размер;
		Движение.Подразделение = ТекСтрокаДополнительныеНачисления.Подразделение;
	КонецЦикла;
	Движения.ДополнительныеНачисления.Записать();
	// регистр Удержания
	Движения.Удержания.Записывать = Истина;
	Для Каждого ТекСтрокаУдержания Из Удержания Цикл
		Движение = Движения.Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаУдержания.ВидРасчета;
		Движение.ПериодРегистрации = НачалоМесяца(Дата);
		Движение.Сотрудник = ТекСтрокаУдержания.Сотрудник;
		Движение.Подразделение = ТекСтрокаОсновныеНачисления.Подразделение;
		Движение.БазовыйПериодНачало=НачалоМесяца(ТекСтрокаОсновныеНачисления.ДатаНачала);
		Движение.БазовыйПериодКонец=КонецМесяца(Дата);//ТекСтрокаОсновныеНачисления.ДатаОкончания);
		Движение.Результат = 0;//Результат;
		Движение.Размер = ТекСтрокаУдержания.Размер;
		Движение.Подразделение = ТекСтрокаУдержания.Подразделение;
	КонецЦикла;
   	Движения.Удержания.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ 
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//Запрос = Новый Запрос;
	//МВТ=Новый МенеджерВременныхТаблиц;
	//Запрос.МенеджерВременныхТаблиц=МВТ;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	НачислениеЗарплатыОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	//	|	НачислениеЗарплатыОсновныеНачисления.Сотрудник КАК Сотрудник,
	//	|	НачислениеЗарплатыОсновныеНачисления.Подразделение КАК Подразделение,
	//	|	НачислениеЗарплатыОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	//	|	НачислениеЗарплатыОсновныеНачисления.ДатаНачала КАК ДатаНачала,
	//	|	НачислениеЗарплатыОсновныеНачисления.ДатаОкончания КАК ДатаОкончания,
	//	|	НачислениеЗарплатыОсновныеНачисления.Размер КАК Размер,
	//	|	НачислениеЗарплатыОсновныеНачисления.График КАК График
	//	|ПОМЕСТИТЬ ТЧ
	//	|ИЗ
	//	|	Документ.НачислениеЗарплаты.ОсновныеНачисления КАК НачислениеЗарплатыОсновныеНачисления
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	НачислениеЗарплатыДополнительныеНачисления.НомерСтроки,
	//	|	НачислениеЗарплатыДополнительныеНачисления.Сотрудник,
	//	|	НачислениеЗарплатыДополнительныеНачисления.Подразделение,
	//	|	НачислениеЗарплатыДополнительныеНачисления.ВидРасчета,
	//	|	НачислениеЗарплатыДополнительныеНачисления.ДатаНачала,
	//	|	НачислениеЗарплатыДополнительныеНачисления.ДатаОкончания,
	//	|	НачислениеЗарплатыДополнительныеНачисления.Размер
	//	|ИЗ
	//	|	Документ.НачислениеЗарплаты.ДополнительныеНачисления КАК НачислениеЗарплатыДополнительныеНачисления
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	НачислениеЗарплатыУдержания.НомерСтроки,
	//	|	НачислениеЗарплатыУдержания.Сотрудник,
	//	|	НачислениеЗарплатыУдержания.Подразделение,
	//	|	НачислениеЗарплатыУдержания.ВидРасчета,
	//	|	НачислениеЗарплатыУдержания.ДатаНачала,
	//	|	НачислениеЗарплатыУдержания.ДатаОкончания,
	//	|	НачислениеЗарплатыУдержания.Размер
	//	|ИЗ
	//	|	Документ.НачислениеЗарплаты.Удержания КАК НачислениеЗарплатыУдержания
	//	|ГДЕ
	//	|	НачислениеЗарплатыУдержания.Ссылка = &Ссылка";
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//РезультатЗапроса =Запрос.Выполнить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
		|	ОсновныеНачисленияДанныеГрафика.Подразделение КАК Подразделение,
		|	ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
		|	ОсновныеНачисленияДанныеГрафика.График КАК График,
		|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК ЗначениеПериодДействия,
		|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ЗначениеФактическийПериодДействия
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	//////////////////////////////////////////
	Для каждого Запись Из Движения.ОсновныеНачисления Цикл
		Если Запись.ВидРасчета.СпособРасчета=Перечисления.СпособыРасчета.Оклад Тогда
			Выборка.Сбросить();
			Если Выборка.НайтиСледующий(Запись.НомерСтроки,"НомерСтроки") Тогда
				Запись.Результат=Запись.Размер*Выборка.ЗначениеФактическийПериодДействия/Выборка.ЗначениеПериодДействия;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Движения.ОсновныеНачисления.Записать(,Истина);
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц=МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияБазаОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисленияБазаОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ОсновныеНачисленияБазаОсновныеНачисления.Подразделение КАК Подразделение,
		|	ОсновныеНачисленияБазаОсновныеНачисления.РезультатБаза КАК РезультатБаза,
		|	ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК ЗначениеФактическийПериодДействия,
		|	ОсновныеНачисленияДанныеГрафика.ЗначениеБазовыйПериод КАК ЗначениеБазовыйПериод
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления.БазаОсновныеНачисления(
		|			&Измерение,
		|			&Измерение,
		|			,
		|			БазовыйПериодНачало = ДОБАВИТЬКДАТЕ(&Период, КВАРТАЛ, -1)
		|				И БазовыйПериодКонец = ДОБАВИТЬКДАТЕ(&Период, СЕКУНДА, -1)) КАК ОсновныеНачисленияБазаОсновныеНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
		|				БазовыйПериодНачало = ДОБАВИТЬКДАТЕ(&Период, КВАРТАЛ, -1)
		|					И БазовыйПериодКонец = ДОБАВИТЬКДАТЕ(&Период, СЕКУНДА, -1)) КАК ОсновныеНачисленияДанныеГрафика
		|		ПО ОсновныеНачисленияБазаОсновныеНачисления.НомерСтроки = ОсновныеНачисленияДанныеГрафика.НомерСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОсновныеНачисленияБазаОсновныеНачисления.НомерСтроки,
		|	ОсновныеНачисленияБазаОсновныеНачисления.Сотрудник,
		|	ОсновныеНачисленияБазаОсновныеНачисления.Подразделение,
		|	ОсновныеНачисленияБазаОсновныеНачисления.РезультатБаза,
		|	ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия,
		|	ОсновныеНачисленияДанныеГрафика.ЗначениеБазовыйПериод
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления.БазаОсновныеНачисления(
		|			&Измерение,
		|			&Измерение,
		|			,
		|			БазовыйПериодНачало = ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, -2)
		|				И БазовыйПериодКонец = ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, 1), СЕКУНДА, -1)) КАК ОсновныеНачисленияБазаОсновныеНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
		|				БазовыйПериодНачало = ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, -2)
		|					И БазовыйПериодКонец = ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, 1), СЕКУНДА, -1)) КАК ОсновныеНачисленияДанныеГрафика
		|		ПО ОсновныеНачисленияБазаОсновныеНачисления.НомерСтроки = ОсновныеНачисленияДанныеГрафика.НомерСтроки";
	
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Ссылка.Дата));
	Измерение=Новый Массив(2);
	Измерение[0]="Сотрудник";
	Измерение[1]="Подразделение";
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Ссылка.Дата));
	Запрос.УстановитьПараметр("Измерение", Измерение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Отпуск
	Выборка= РезультатЗапроса.Выбрать();
	Для каждого Запись Из Движения.ОсновныеНачисления Цикл
		Если Запись.ВидРасчета.СпособРасчета=Перечисления.СпособыРасчета.Отпуск Тогда
			Выборка.Сбросить();
			Если Выборка.НайтиСледующий(Запись.НомерСтроки) Тогда
				Запись.Результат=Выборка.РезультатБаза*Выборка.ЗначениеФактическийПериодДействия/Выборка.ЗначениеБазовыйПериод;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Движения.ОсновныеНачисления.Записать(,Истина);
	//Премия   
	Для каждого Запись Из Движения.ДополнительныеНачисления Цикл
		Если Запись.ВидРасчета.СпособРасчета=Перечисления.СпособыРасчета.Премия Тогда
			Запись.Результат=Запись.Размер;
		КонецЕсли;
	КонецЦикла;
	Движения.ДополнительныеНачисления.Записать(,Истина);

	//Профсоюз
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УдержанияБазаОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	УдержанияБазаОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	УдержанияБазаОсновныеНачисления.Подразделение КАК Подразделение,
	|	УдержанияБазаОсновныеНачисления.РезультатБаза КАК РезультатБаза
	|ИЗ
	|	РегистрРасчета.Удержания.БазаОсновныеНачисления(&Измерение, &Измерение, , Регистратор = &Ссылка) КАК УдержанияБазаОсновныеНачисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УдержанияБазаДополнительныеНачисления.НомерСтроки,
	|	УдержанияБазаДополнительныеНачисления.Сотрудник,
	|	УдержанияБазаДополнительныеНачисления.Подразделение,
	|	УдержанияБазаДополнительныеНачисления.РезультатБаза
	|ИЗ
	|	РегистрРасчета.Удержания.БазаДополнительныеНачисления(&Измерение, &Измерение, , Регистратор = &Ссылка) КАК УдержанияБазаДополнительныеНачисления
	|ИТОГИ
	|	СУММА(РезультатБаза)
	|ПО
	|	НомерСтроки";
	
	Измерение=Новый Массив(2);
	Измерение[0]="Сотрудник";
	Измерение[1]="Подразделение";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Измерение", Измерение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Для каждого Запись Из Движения.Удержания Цикл
		Если Запись.ВидРасчета.СпособРасчета=Перечисления.СпособыРасчета.Профсоюз Тогда
			Выборка.Сбросить();
			Если Выборка.НайтиСледующий(Запись.НомерСтроки) Тогда
				Запись.Результат=Выборка.РезультатБаза*Запись.Размер/100;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Движения.Удержания.Записать(,Истина);
КонецПроцедуры
