
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Хозяйсвенный 
	Движения.Хозяйсвенный.Записывать = Истина;
	Движения.Хозяйсвенный.Записать();
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтправлениеТовары.Товар КАК Товар,
		|	СУММА(ОтправлениеТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ТЧ
		|ИЗ
		|	Документ.Отправление.Товары КАК ОтправлениеТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтправлениеТовары.Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.Товар КАК Товар,
		|	ТЧ.Количество КАК Количество,
		|	ХозяйсвенныйОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ХозяйсвенныйОстатки.КоличествоОстатокДт КАК КоличествоОстаток
		|ИЗ
		|	ТЧ КАК ТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозяйсвенный.Остатки(
		|				&Граница,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Товары),
		|				,
		|				Субконто1 В
		|						(ВЫБРАТЬ
		|							ТЧ.Товар КАК Товар
		|						ИЗ
		|							ТЧ КАК ТЧ)
		|					И Субконто2 = &Склад) КАК ХозяйсвенныйОстатки
		|		ПО ТЧ.Товар = ХозяйсвенныйОстатки.Субконто1";
	
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени()));
	Запрос.УстановитьПараметр("Склад", СкладОтправитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать(); 
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Хозяйсвенный");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.УстановитьЗначение("Субконто2", СкладОтправитель);
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Субконто1", "Товар");
	Блокировка.Заблокировать();
	
	Пока Выборка.Следующий() Цикл
		Нехватка=Выборка.Количество-Выборка.КоличествоОстаток;
		Если Нехватка>0 Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не хватает "+Нехватка+" номенклатуры "+Выборка.Товар;
			Сообщение.Сообщить();
			Отказ=Истина;
		КонецЕсли;
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		Если Выборка.КоличествоОстаток>0 Тогда
			Движение = Движения.Хозяйсвенный.Добавить();
			Движение.СчетДт = ПланыСчетов.Управленческий.ТоварыВПути;
			Движение.СчетКт = ПланыСчетов.Управленческий.Товары;
			Движение.Период = Дата;
			Движение.Сумма = ?(Выборка.Количество=Выборка.КоличествоОстаток,Выборка.СуммаОстаток,  Выборка.Количество*Выборка.СуммаОстаток/Выборка.КоличествоОстаток);
			Движение.КоличествоДт = Выборка.Количество;
			Движение.КоличествоКт = Выборка.Количество;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Товар;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Товар;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = СкладОтправитель;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
