 
Процедура ОбработкаПроведения(Отказ, Режим)
	// Блокировка ДО чтения остатков
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Свойство", "Свойство");
	Блокировка.Заблокировать();
	// регистр ОстаткиНоменклатуры Расход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Движения.ОстаткиНоменклатуры.Записать(); 
	

	Сорт = "ВОЗР"; // ФИФО
	Политики = РегистрыСведений.Политки.ПолучитьПоследнее(МоментВремени());
	
	Если Не Политики=Неопределено ИЛИ Политики.Политика = Перечисления.УчетнаяПолитика.ЛИФО Тогда
		Сорт = "УБЫВ"; // ЛИФО
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон("ВЫБРАТЬ
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяСписокНоменклатуры.Свойство КАК Свойство,
	|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество,
	|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ТЧ
	|ИЗ
	|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
	|ГДЕ
	|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура,
	|	РасходнаяНакладнаяСписокНоменклатуры.Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Свойство КАК Свойство,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Сумма КАК Сумма,
	|	ОстаткиНоменклатурыОстатки.Партия КАК Партия,
	|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	ТЧ КАК ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(&Граница, (Номенклатура, Свойство) В
	|			(ВЫБРАТЬ
	|				ТЧ.Номенклатура КАК Номенклатура,
	|				ТЧ.Свойство КАК Свойство
	|			ИЗ
	|				ТЧ КАК ТЧ)) КАК ОстаткиНоменклатурыОстатки
	|		ПО ТЧ.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
	|		И ТЧ.Свойство = ОстаткиНоменклатурыОстатки.Свойство
	|
	|УПОРЯДОЧИТЬ ПО
	|	Партия.Дата %1
	|ИТОГИ
	|	МАКСИМУМ(Количество),
	|	МАКСИМУМ(Сумма),
	|	СУММА(КоличествоОстаток),
	|	СУММА(СуммаОстаток)
	|ПО
	|	Номенклатура,
	|	Свойство", Сорт);

	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени()));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	ВыборкаНоменклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаНоменклатура.Следующий() Цикл
		ВыборкаСвойство = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//Количество=ВыборкаСвойство.Количество;

		Пока ВыборкаСвойство.Следующий() Цикл
			Нехватка = ВыборкаСвойство.Количество - ВыборкаСвойство.КоличествоОстаток;
			Если Нехватка > 0 Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтрШаблон("Не хватает %1 %2 (%3)",
					Формат(Нехватка, "ЧДЦ=2; ЧГ=0; ЧФ=Ч"),
					ВыборкаНоменклатура.Номенклатура,
					ВыборкаСвойство.Свойство);
				Сообщение.Сообщить();
				Отказ = Истина;
				Продолжить;
			КонецЕсли;

			ВыборкаПартий = ВыборкаСвойство.Выбрать();
			ОсталосьСписать = ВыборкаСвойство.Количество;
		//Сумма=ВыборкаСвойство.СуммаОстаток;

			Пока ВыборкаПартий.Следующий() И ОсталосьСписать > 0 Цикл
				Если ВыборкаПартий.КоличествоОстаток <= 0 Тогда
					Продолжить;
				КонецЕсли;

				Спишем = Мин(ОсталосьСписать, ВыборкаПартий.КоличествоОстаток);

				Движение = Движения.ОстаткиНоменклатуры.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Номенклатура = ВыборкаПартий.Номенклатура;
				Движение.Свойство = ВыборкаПартий.Свойство;
				Движение.Партия = ВыборкаПартий.Партия;
 				Движение.Количество = Спишем;
 				Движение.Сумма = ?(Спишем = ВыборкаПартий.КоличествоОстаток,
					ВыборкаПартий.СуммаОстаток,
					Окр(Спишем * ВыборкаПартий.СуммаОстаток / ВыборкаПартий.КоличествоОстаток, 2));
				//Сумма=Сумма-ВыборкаПартий.СуммаОстаток;
				ОсталосьСписать = ОсталосьСписать - Спишем;
			КонецЦикла;
			//Движение.Сумма=Движение.Сумма+Сумма;
		
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры
