
&НаСервере
Процедура СформироватьНаСервере()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияФактическийПериодДействия.Сотрудник КАК Сотрудник,
		|	ОсновныеНачисленияФактическийПериодДействия.ВидРасчета КАК ВидРасчета,
		|	ОсновныеНачисленияФактическийПериодДействия.ПериодДействияНачало КАК ПериодДействияНачало,
		|	ОсновныеНачисленияФактическийПериодДействия.ПериодДействияКонец КАК ПериодДействияКонец
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления.ФактическийПериодДействия(
		|			Активность = ИСТИНА
		|				И (ПериодДействия МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|				И ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Отпуск)) КАК ОсновныеНачисленияФактическийПериодДействия";
	
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	Диаграмма.Очистить();
	Пока Выборка.Следующий() Цикл
		Точка=Диаграмма.УстановитьТочку(Выборка.Сотрудник);
		Точка.Текст =Выборка.Сотрудник;
		Серия=Диаграмма.УстановитьСерию(Выборка.ВидРасчета);
		Серия.Текст=Выборка.ВидРасчета;
		ТекущееЗначение=Диаграмма.ПолучитьЗначение(Точка, Серия);
		
		ТекущийИнтервал=ТекущееЗначение.Добавить();
		ТекущийИнтервал.Начало=Выборка.ПериодДействияНачало;
		ТекущийИнтервал.Конец=Выборка.ПериодДействияКонец;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
