
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Хозяйсвенный 
	Движения.Хозяйсвенный.Записывать = Истина;
	Движения.Хозяйсвенный.Записать();
	
	Набор=РегистрыБухгалтерии.Хозяйсвенный.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(ДокументОтправления);
	Набор.Прочитать();
	Движения.Хозяйсвенный.БлокироватьДляИзменения=Истина;
	Для каждого Запись Из Набор Цикл
		Движение = Движения.Хозяйсвенный.Добавить();
		Движение.СчетДт = ПланыСчетов.Управленческий.Товары;
		Движение.СчетКт = ПланыСчетов.Управленческий.ТоварыВПути;
		Движение.Период = ДатаПрибытия;
		Движение.Сумма = Запись.Сумма;
		Движение.КоличествоДт = Запись.КоличествоКт;
		Движение.КоличествоКт = Запись.КоличествоДт;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Запись.СубконтоКт.Номенклатура;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = ДокументОтправления.СкладПолучатель;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Запись.СубконтоДт.Номенклатура;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Отправление") Тогда
		// Заполнение шапки
		ДокументОтправления = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры
